# -*- coding: utf-8 -*-
# @Time    : 2018/11/12 0012 11:16
# @Author  : 北极的大企鹅！！
# @FileName: 010_Three_Linkage.py
# @Software: PyCharm


print('\n')
print('********** 三级菜单 version 3, 优化版本 *************   \n')

msg = '''
--------- message --------
   要求:
	1、打印省、市、县三级菜单
	2、可返回上一级
	3、可随时退出程序
   转化：
	 简化版本,高级版本
--------------------------
'''

print(msg)

menu = {
	'河北省': {
		'石家庄市': {
			'长安区': {},
			'桥西区': {},
			'新华区': {},
			'井陉矿区': {},
			'裕华区': {},
			'藁城区': {},
			'鹿泉区': {},
			'栾城区': {},
			'井陉县': {},
			'正定县': {},
			'行唐县': {},
			'灵寿县': {},
			'高邑县': {},
			'深泽县': {},
			'赞皇县': {},
			'无极县': {},
			'平山县': {},
			'元氏县': {},
			'赵县': {},
			'辛集市': {},
			'晋州市': {},
			'新乐市': {}
			
		},
		'唐山市': {
			'路南区': {},
			'路北区': {},
			'开平区': {},
			'丰南区': {},
			'丰润区': {},
			'曹妃甸区': {},
			'滦县': {},
			'滦南县': {},
			'乐亭县': {},
			'迁西县': {},
			'玉田县': {},
			'遵化市': {},
			'迁安市': {}
			
		},
		'秦皇岛市': {},
		'邯郸市': {},
		'邢台市': {},
		'保定市': {},
		'张家口市': {},
		'承德市': {},
		'沧州市': {},
		'廊坊市': {},
		'衡水市': {}
	},
	'辽宁省': {
		'沈阳市': {},
		'大连市': {},
		'鞍山市': {},
		'抚顺市': {},
		'本溪市': {},
		'丹东市': {},
		'锦州市': {},
		'营口市': {},
		'阜新市': {},
		'辽阳市': {},
		'盘锦市': {},
		'铁岭市': {},
		'朝阳市': {},
		'葫芦岛市': {}
		
	},
	'吉林省': {},
	'黑龙江省': {},
	'江苏省': {},
	'浙江省': {}
	
}

current_layer = menu

parent_layers = []

while True:
	for key in current_layer:
		print(key)
	choice = input('>>>:').strip()
	if len(choice) == 0: continue
	if choice in current_layer:
		parent_layers.append(current_layer)
		current_layer = current_layer[choice]
	elif choice == 'b':
		if parent_layers:
			current_layer = parent_layers.pop()
	else:
		print('无此选项....')
