# -*- coding: utf-8 -*-
"""
__title__ = ""
__author__ = "liuya"
__mtime__ = "2017-12-20"
# code is far away from bugs with the god animal protecting
I love animals. They taste delicious.
┏┓ ┏┓
┏┛┻━━━┛┻┓
┃ ☃ ┃
┃ ┳┛ ┗┳ ┃
┃ ┻ ┃
┗━┓ ┏━┛
┃ ┗━━━┓
┃ 神兽保佑 ┣┓
┃　永无BUG！ ┏┛
┗┓┓┏━┳┓┏┛
┃┫┫ ┃┫┫
┗┻┛ ┗┻┛
"""

#########################加减乘除运算############################

######双斜杠py中表示取整
print('取整', int(9 // 4))

###############加法#####
print('加法', 9 + 6)

#############减法##################
print('减法', 9 - 6)

############乘法#####################
print('乘法', 5 * 6)

#############除法#######################
print('除法', 6 / 3)

################取模###############################
print('取模', 9 % 6)


