# -*- coding: utf-8 -*-
# @Time    : 2018/10/31 0031 21:27
# @Author  : 北极的大企鹅！！
# @FileName: 005_Data_Type.py
# @Software: PyCharm


print('\n')
print('********** 数据类型*************   \n')

print('********** 整型 *************   \n')
print(2 ** 30)
print(-2 ** 30)
print(2 ** 100, end="***********长整型")

print('********** 数据不需要声明数据类型,弱类型语言 *************   \n')

print('********** 虚数 *************   \n')
print('********** j是工程学,虚数的标识方法,数学是i *************   \n')
print(5 + 4j)

print('********** 布尔类型 *************   \n')
print('********** 只有两种状态 *************   \n')
print(True, end='********** 真 *************   \n')
print(False, end='********** 假 *************   \n')


print('********** 字符串 *************   \n')

name="张安"
print("hello"+name)